# 2. Написати функцію < bank > , яка працює за наступною логікою: 
# користувач робить вклад у розмірі < a > одиниць строком на < years > років 
# під < percents > відсотків (кожен рік сума вкладу збільшується на цей відсоток, 
# ці гроші додаються до суми вкладу і в наступному році на них також нараховуються відсотки). 
# Параметр < percents > є необов'язковим і має значення по замовчуванню < 10 > (10%). 
# Функція повинна принтануть і вернуть суму, яка буде на рахунку.
# Можна використати формулу капіталізації відсотків:
# Вклад у кінцідепозитного періоду = D * (1 + P / 100) ** N, де
# D - величина початкового депозиту.
# P – процент за депозитний період капіталізаії (місяц, квартал, рік).
# N – кількість періодів при капіталізації відсотків в депозитному періоді.

def bank(a, years, percents):
    deposit_value = a * ((1 + percents) ** years)
    return round(deposit_value, 2)

if __name__ == '__main__':
    a = int(input('Input value of deposit: ') or 0)
    years = int(input('Input quantity years of deposit: ') or 0)
    percents = float((input('Input percents of deposit : ')) or 10) / 100
    print(bank(a, years, percents))